<?php

use yii\db\Migration;

/**
 * Handles the creation of table `page`.
 */
class m180220_191037_create_page_table extends Migration
{
    /**
     * @inheritdoc
     */
    public function up()
    {
        $this->createTable('page', [
            'id' => $this->bigPrimaryKey(),
            'title' => $this->string(),
            'text' => $this->text(),
            'url' => $this->string(),
            'category_id' => $this->integer(),
        ]);
        $this->batchInsert('page', ['title', 'text', 'url', 'category_id'], [
            ['Страница №1', 'Текст страницы №1', 'page1', 1],
            ['Страница №2', 'Текст страницы №2', 'page2', 1],
            ['Страница №3', 'Текст страницы №3', 'page3', 1],
            ['Страница №4', 'Текст страницы №4', 'page4', 2],
            ['Страница №5', 'Текст страницы №5', 'page5', 2],
            ['Страница №6', 'Текст страницы №6', 'page6', 1],
            ['Страница №7', 'Текст страницы №7', 'page7', 1],
            ['Страница №8', 'Текст страницы №8', 'page8', 1],
            ['Страница №9', 'Текст страницы №9', 'page9', 2],
            ['Страница №10', 'Текст страницы №10', 'page10', 1],
            ['Страница №11', 'Текст страницы №11', 'page11', 1],
            ['Страница №12', 'Текст страницы №12', 'page12', 2],
            ['Страница №13', 'Текст страницы №13', 'page13', 3],
            ['Страница №14', 'Текст страницы №14', 'page14', 4],
            ['Страница №15', 'Текст страницы №15', 'page15', 4],
            ['Страница №16', 'Текст страницы №16', 'page16', 3],
            ['Страница №17', 'Текст страницы №17', 'page17', 2],
            ['Страница №18', 'Текст страницы №18', 'page18', 1],
            ['Страница №19', 'Текст страницы №19', 'page19', 2],
            ['Страница №20', 'Текст страницы №20', 'page20', 2]
        ]);

    }

    /**
     * @inheritdoc
     */
    public function down()
    {
        $this->dropTable('page');
    }
}
